<?php
// на входе толщина в мм и масса в кг
$width = (float)$argv[1];
$mass = (float)$argv[2];

function getCoefficient(float $width): ?float
{
    return match ($width) {
        0.5 => 3.925,
        0.6 => 4.71,
        0.7 => 5.495,
        0.8 => 6.28,
        0.9 => 7.065,
        1.0 => 7.85,
        1.2 => 9.42,
        1.4 => 10.99,
        1.5 => 11.775,
        1.7 => 13.345,
        1.8 => 14.13,
        1.9 => 14.915,
        2.0 => 15.7,
        2.5 => 19.625,
        3.0 => 23.55,
        3.5 => 27.475,
        4.0 => 31.4,
        5.0 => 39.25,
        6.0 => 47.1,
        7.0 => 54.95,
        8.0 => 62.8,
        9.0 => 70.65,
        10.0 => 78.5,
        12.0 => 94.2,
        14.0 => 109.9,
        16.0 => 125.6,
        18.0 => 141.3,
        20.0 => 157,
        22.0 => 172.7,
        25.0 => 196.25,
        30.0 => 235.5,
        35.0 => 274.75,
        40.0 => 314,
        45.0 => 353.25,
        50.0 => 392.5,
        55.0 => 431.75,
        60.0 => 471,
        65.0 => 510.25,
        70.0 => 549.5,
        75.0 => 588.75,
        80.0 => 628,
        90.0 => 706.5,
        100.0 => 785,
        110.0 => 863.5,
        120.0 => 942,
        130.0 => 1020.5,
        140.0 => 1099,
        150.0 => 1177.5,
        160.0 => 1256,
        170.0 => 1334.5,
        180.0 => 1413,
        190.0 => 1491.5,
        200.0 => 1570,
        default => null,
    };
}

function getSurfaceArea(float $mass, float $coefficient): float
{
    return $mass / $coefficient * 2;
}

$coefficient = getCoefficient($width);
if (!$coefficient) {
    exit("Значение толщины листа не соответствует ГОСТ 19904-90, 19903-74\n");
}
$surfaceArea = getSurfaceArea($mass, $coefficient);

echo sprintf("Приведенная толщина металла: %.3f мм\n", $width / 2);
echo sprintf("Площадь поверхности: %.3f м2\n", $surfaceArea);

exit();
